200_Ahmed-body/001_Ahmed-body35/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (40 0 0);
pressure             0;
turbulentKE          0.1;
turbulentOmega       11.1; // 内部の初期値(omega=epsilon/k/Cmu=0.1/0.1/0.09)

// ************************************************************************* //
